<a href="https://colab.research.google.com/github/rodrigowe1988/Data-Science-na-Pratica/blob/main/Relembrando_os_conhecimentos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#importando a biblioteca pandas 
import pandas as pd
#importar as documentações das funções
import torch

## Relembrando os conhecimentos

In [ ]:
#importtar o arquivo csv para o pandas
df = pd.read_csv("https://raw.githubusercontent.com/carlosfab/dsnp2/master/datasets/BBAS3.SA.csv")
#mostrar na tela as 5 primeiras linhas do DataFrame
df.head()

         Date       Open       High  ...      Close  Adj Close      Volume
0  2019-05-06  49.470001  49.669998  ...  49.369999  46.886795   6314800.0
1  2019-05-07  49.080002  49.680000  ...  49.490002  47.000763  10846100.0
2  2019-05-08  49.500000  50.840000  ...  50.590000  48.045422  14459600.0
3  2019-05-09  50.910000  51.259998  ...  51.029999  48.463291  15377500.0
4  2019-05-10  51.099998  51.189999  ...  50.160000  47.637051   8975300.0

[5 rows x 7 columns]

In [ ]:
#visualizando o tipo do df e das colunas
print(f"Tipo da tabela: {type(df)}.")
print(f"Tipo das colunas: {type(df.Date)}.")

Tipo da tabela: <class 'pandas.core.frame.DataFrame'>.
Tipo das colunas: <class 'pandas.core.series.Series'>.

In [ ]:
#saber o tamanho do DataFrame 
print(f"O dataframe possui {df.shape[0]} linhas e {df.shape[1]} colunas.")

O dataframe possui 248 linhas e 7 colunas.

In [ ]:
#exibir as últimas 5 linhas do DF
df.tail()

           Date       Open       High  ...      Close  Adj Close      Volume
243  2020-04-27  25.500000  26.200001  ...  25.690001  25.690001  32132800.0
244  2020-04-28  27.219999  29.250000  ...  29.139999  29.139999  43232700.0
245  2020-04-29  30.040001  30.209999  ...  29.559999  29.559999  24628700.0
246  2020-04-30  28.309999  28.780001  ...  28.500000  28.500000  23935300.0
247  2020-05-04  27.370001  27.760000  ...  27.760000  27.760000  16586000.0

[5 rows x 7 columns]

In [ ]:
#salvar numa variável o nome das colunas
nome_das_colunas = df.columns
nome_das_colunas

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [ ]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume       float64
dtype: object

## Formas de trabalhar com o conteúdo de uma coluna

In [ ]:
df["High"]

0      49.669998
1      49.680000
2      50.840000
3      51.259998
4      51.189999
         ...
243    26.200001
244    29.250000
245    30.209999
246    28.780001
247    27.760000
Name: High, Length: 248, dtype: float64

In [ ]:
 df.High

0      49.669998
1      49.680000
2      50.840000
3      51.259998
4      51.189999
         ...
243    26.200001
244    29.250000
245    30.209999
246    28.780001
247    27.760000
Name: High, Length: 248, dtype: float64

In [ ]:
df.High.mean()

46.57639677327938

In [ ]:
df.High.median()

48.779999

### Coluna Date

In [ ]:
#converter o formato da coluna Date para datetime
df.Date = pd.to_datetime(df.Date, format="%Y-%m-%d")

### OBS: atribua as modificações para a coluna para de fato elas ocorrerem.

In [ ]:
df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume              float64
dtype: object

In [ ]:
df.Date.dt.year

0      2019
1      2019
2      2019
3      2019
4      2019
       ...
243    2020
244    2020
245    2020
246    2020
247    2020
Name: Date, Length: 248, dtype: int64

## Criando DataFrames

In [ ]:
#criando um dicionário
dados = {
    'nome': ['Carlos', 'Theo', 'Raquel', 'Fernanda'],
    'idade': [35, 32, 15, 49],
    'cidade': ['Araraquara', 'Belém', 'Natal', 'Curitiba'],
    'comprou': [True, False, False, True]
}

Uma vez criado o dicionário, com um simples comando conseguimos transformá-lo num DataFrame.

In [ ]:
#criando Dataframe
df = pd.DataFrame(dados)

In [ ]:
df

       nome  idade      cidade  comprou
0    Carlos     35  Araraquara     True
1      Theo     32       Belém    False
2    Raquel     15       Natal    False
3  Fernanda     49    Curitiba     True

Após criarmos nosso dataframe podemos adicionar elementos a ele:

In [ ]:
#criar coluna id_usuario
id_usuario = [4421, 5831, 4421, 9873]

In [ ]:
df.index = id_usuario
df

          nome  idade      cidade  comprou  saldo
4421    Carlos     35  Araraquara     True    0.0
5831      Theo     32       Belém    False    0.0
4421    Raquel     15       Natal    False    0.0
9873  Fernanda     49    Curitiba     True    0.0

In [ ]:
df.loc[[4421, 5831]]

        nome  idade      cidade  comprou  saldo
4421  Carlos     35  Araraquara     True    0.0
4421  Raquel     15       Natal    False    0.0
5831    Theo     32       Belém    False    0.0

In [ ]:
#criando uma nova coluna
df['saldo'] = 0.0
df

          nome  idade      cidade  comprou  saldo
8712    Carlos     35  Araraquara     True    0.0
5831      Theo     32       Belém    False    0.0
4421    Raquel     15       Natal    False    0.0
9873  Fernanda     49    Curitiba     True    0.0

In [ ]:
df_teste = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])
df_teste

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [2]:
import os